package kr.ac.kopo.Lecture;

public class HandPhone {
    //** 소유주 **// => 문서화 주석
    String name;
    //** 전화번호 **//
    String number;
    //** 제조사 **//
    String company;

    String price;
}

// 다음의 결과를 보이는 프로그램을 작성하시오
// 아이스크림을 몇 개 구입할거야? -> ex) 4개를 입력 받았다고 치면
// *** 1번째 아이스크림 구매 정보 입력 ***
// 아이스크림명 : 비비빅
// 아이스크림 가격 : 1000

// *** 2번째 아이스크림 구매 정보 입력 ***
// 아이스크림명 : 거북알
// 아이스크림 가격 : 1500

// *** 3번째 아이스크림 구매 정보 입력 ***
// 아이스크림명 : 스크류바
// 아이스크림 가격 : 1500

// *** 4번째 아이스크림 구매 정보 입력 ***
// 아이스크림명 : 메로나
// 아이스크림 가격 : 1500

// *** 5번째 아이스크림 구매 정보 입력 ***
// 아이스크림명 : 죠스바
// 아이스크림 가격 : 1500

// 5개 아이스크림 구매 정보 출력 => 프린트
// 번호 아이스크림명 아이스크림 가격
// 1    비비빅        1000
// 2    거북알        1500
// 3    스크류바      1000
// 4    월드콘        2000
// 총합 : 5500원

// 계속 구매할까요? y 또는 n을 입력받아
// if yes이면 아이스크림 몇개 구매할래?
// 2개
// if 계속 구매할까요? n